# Combining and Merging Data sets

In [1]:
#Database style dataframe merges

In [2]:
#Merge or join operations combine data sets by linking rows using one or more keys.

In [ ]:
#mERGING CAN ONLY BE DONE FOR NON OVERLAPPING COLUMNS

In [2]:
import pandas as pd
from pandas import DataFrame,Series
import numpy as np

In [6]:
df1 = DataFrame({'key':['b','b','a','c','a','a','b'],'data1':range(7)})
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [7]:
df2=DataFrame({'key':['a','b','d'],'data2':range(3)})
df2

   data2 key
0      0   a
1      1   b
2      2   d

# many to one merge

In [ ]:
#data1 has many rows of each 'a' and 'b' while data2 has only one row of each 'a' and 'b' so it is many to one

In [8]:
pd.merge(df1,df2)

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [9]:
#if key is not specified it will merge the overlapiing column names
pd.merge(df1,df2,on='key')

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [10]:
#if the column names are different in each object 
df3 = DataFrame({'lkey':['b','b','a','c','a','a','b'],'data1':range(7)})
df4= DataFrame({'rkey':['a','b','d'],'data2':range(3)})

In [13]:
df3

   data1 lkey
0      0    b
1      1    b
2      2    a
3      3    c
4      4    a
5      5    a
6      6    b

In [14]:
df4

   data2 rkey
0      0    a
1      1    b
2      2    d

In [15]:
pd.merge(df3,df4,left_on='lkey',right_on='rkey')

   data1 lkey  data2 rkey
0      0    b      1    b
1      1    b      1    b
2      6    b      1    b
3      2    a      0    a
4      4    a      0    a
5      5    a      0    a

In [19]:
#by default merge does an inner join(intersection),other joins are 'left'(include all the elements in the left),
#'right'(include all the elements in the right),'outer'(union).

In [17]:
pd.merge(df1,df2,how='outer')#union of all the elements in the keys

   data1 key  data2
0    0.0   b    1.0
1    1.0   b    1.0
2    6.0   b    1.0
3    2.0   a    0.0
4    4.0   a    0.0
5    5.0   a    0.0
6    3.0   c    NaN
7    NaN   d    2.0

In [18]:
pd.merge(df1,df2,how='left')#include all the elements in the left

   data1 key  data2
0      0   b    1.0
1      1   b    1.0
2      2   a    0.0
3      3   c    NaN
4      4   a    0.0
5      5   a    0.0
6      6   b    1.0

In [21]:
pd.merge(df1,df2,how='right')#include all the elements in the right

   data1 key  data2
0    0.0   b      1
1    1.0   b      1
2    6.0   b      1
3    2.0   a      0
4    4.0   a      0
5    5.0   a      0
6    NaN   d      2

# many to many merges

In [ ]:
#many to many merges form cartesian product of rows

In [2]:
df1 = DataFrame({'key':['b','b','a','c','a','b'],'data1':range(6)})
df2 = DataFrame({'key':['a','b','a','b','d'],'data2':range(5)})
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [3]:
df2

   data2 key
0      0   a
1      1   b
2      2   a
3      3   b
4      4   d

In [4]:
pd.merge(df1,df2,on='key',how='left')#only left key elements will be consideres

    data1 key  data2
0       0   b    1.0
1       0   b    3.0
2       1   b    1.0
3       1   b    3.0
4       2   a    0.0
5       2   a    2.0
6       3   c    NaN
7       4   a    0.0
8       4   a    2.0
9       5   b    1.0
10      5   b    3.0

In [5]:
pd.merge(df1,df2,how='inner')

   data1 key  data2
0      0   b      1
1      0   b      3
2      1   b      1
3      1   b      3
4      5   b      1
5      5   b      3
6      2   a      0
7      2   a      2
8      4   a      0
9      4   a      2

In [12]:
#passing multiple keys to join

In [9]:
left=DataFrame({'key1':['foo','foo','bar'],'key2':['one','two','one'],'lval':[1,2,3]})
right=DataFrame({'key1':['foo','foo','bar','bar'],'key2':['one','one','one','two'],'rval':[4,5,6,7]})

In [10]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [11]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [16]:
pd.merge(left,right,on=['key1','key2'],how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [19]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [20]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [17]:
pd.merge(left,right,on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [18]:
pd.merge(left,right,on='key1',suffixes=('_left','_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

# Merging on an index

In [1]:
#In some cases, the merge key in a data frame will be found in its index.In this case,you can pass left_index=True
#or right_index=True(or both)

In [5]:
left1= DataFrame({'key':['a','b','a','a','b','c'],'value':range(6)})
right1=DataFrame({'group_val':[3.5,7]},index=['a','b'])

In [6]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [7]:
right1

   group_val
a        3.5
b        7.0

In [10]:
pd.merge(left1,right1,left_on='key',right_index=True,how='left')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [11]:
#With heirarchially indexed data,things are more complicated:

In [14]:
lefth=DataFrame({'key1':['ohio','ohio','ohio','nevada','nevada'],'key2':[2000,2001,2002,2001,2002],'data':np.arange(5.)})
lefth

   data    key1  key2
0   0.0    ohio  2000
1   1.0    ohio  2001
2   2.0    ohio  2002
3   3.0  nevada  2001
4   4.0  nevada  2002

In [16]:
righth=DataFrame(np.arange(12).reshape((6,2)),index=[['nevada','nevada','ohio','ohio','ohio','ohio'],[2001,2000,2000,2000,2001,2002]],columns=['event1','event2'])
righth

             event1  event2
nevada 2001       0       1
       2000       2       3
ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [18]:
pd.merge(lefth,righth,left_on=['key1','key2'],right_index=True)

   data    key1  key2  event1  event2
0   0.0    ohio  2000       4       5
0   0.0    ohio  2000       6       7
1   1.0    ohio  2001       8       9
2   2.0    ohio  2002      10      11
3   3.0  nevada  2001       0       1

In [19]:
pd.merge(lefth,righth,left_on=['key1','key2'],right_index=True,how='outer')

   data    key1  key2  event1  event2
0   0.0    ohio  2000     4.0     5.0
0   0.0    ohio  2000     6.0     7.0
1   1.0    ohio  2001     8.0     9.0
2   2.0    ohio  2002    10.0    11.0
3   3.0  nevada  2001     0.0     1.0
4   4.0  nevada  2002     NaN     NaN
4   NaN  nevada  2000     2.0     3.0

In [ ]:
#Using indexes of both sides of merge

In [20]:
left2=DataFrame([[1.,2.],[3.,4.],[5.,6.]],index=['a','c','e'],columns=['ohio','nevada'])
left2

   ohio  nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [21]:
right2=DataFrame([[7.,8.],[9.,10.],[11.,12.],[13,14]],index=['b','c','d','e'],columns=['Missouri','Albama'])
right2

   Missouri  Albama
b       7.0     8.0
c       9.0    10.0
d      11.0    12.0
e      13.0    14.0

In [22]:
pd.merge(left2,right2,how='outer',left_index=True,right_index=True)

   ohio  nevada  Missouri  Albama
a   1.0     2.0       NaN     NaN
b   NaN     NaN       7.0     8.0
c   3.0     4.0       9.0    10.0
d   NaN     NaN      11.0    12.0
e   5.0     6.0      13.0    14.0

# JOIN

In [ ]:
#JOIN CAN ONLY BE USED FOR NON OVERLAPING COLUMNS

In [23]:
left2.join(right2,how='outer')

   ohio  nevada  Missouri  Albama
a   1.0     2.0       NaN     NaN
b   NaN     NaN       7.0     8.0
c   3.0     4.0       9.0    10.0
d   NaN     NaN      11.0    12.0
e   5.0     6.0      13.0    14.0

In [24]:
left1.join(right1,on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [25]:
#for simple index on index merges we can use join on a list of DataFrames

In [26]:
another=DataFrame([[7.,8.],[9.,10.],[11.,12.],[16.,17.]],index=['a','c','e','f'],columns=['New york','Oregon'])
another

   New york  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      16.0    17.0

In [27]:
left2.join([right2,another])

   ohio  nevada  Missouri  Albama  New york  Oregon
a   1.0     2.0       NaN     NaN       7.0     8.0
c   3.0     4.0       9.0    10.0       9.0    10.0
e   5.0     6.0      13.0    14.0      11.0    12.0

In [28]:
left2.join([right2,another],how='outer')

   ohio  nevada  Missouri  Albama  New york  Oregon
a   1.0     2.0       NaN     NaN       7.0     8.0
b   NaN     NaN       7.0     8.0       NaN     NaN
c   3.0     4.0       9.0    10.0       9.0    10.0
d   NaN     NaN      11.0    12.0       NaN     NaN
e   5.0     6.0      13.0    14.0      11.0    12.0
f   NaN     NaN       NaN     NaN      16.0    17.0

# Concatenating Along an Axis

In [ ]:
#Numpy has a concatenate function

In [29]:
arr = np.arange(12).reshape((3,4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [30]:
np.concatenate([arr,arr],axis=1)#1 for column 0 for row

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [31]:
np.concatenate([arr,arr],axis=0)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [32]:
#pandas uses concat function

In [33]:
s1 = Series([0,1],index=['a','b'])
s2 = Series([2,3,4],index=['c','d','e'])
s3 = Series([5,6],index=['f','g'])

In [34]:
s1

a    0
b    1
dtype: int64

In [35]:
s2

c    2
d    3
e    4
dtype: int64

In [36]:
s3

f    5
g    6
dtype: int64

In [37]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [38]:
pd.concat([s1,s2,s3],axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [41]:
s4=pd.concat([s1*5,s3])
s4

a    0
b    5
f    5
g    6
dtype: int64

In [45]:
pd.concat([s1,s4],axis=1,join_axes=[['a','b','c','d']])#to specify the axes

     0    1
a  0.0  0.0
b  1.0  5.0
c  NaN  NaN
d  NaN  NaN

In [46]:
#concatenated pieces are not identifable in the result.To do so:

In [48]:
result=pd.concat([s1,s2,s3],keys=['one','two','three'])
result

one    a    0
       b    1
two    c    2
       d    3
       e    4
three  f    5
       g    6
dtype: int64

In [49]:
result.unstack()

         a    b    c    d    e    f    g
one    0.0  1.0  NaN  NaN  NaN  NaN  NaN
two    NaN  NaN  2.0  3.0  4.0  NaN  NaN
three  NaN  NaN  NaN  NaN  NaN  5.0  6.0

In [50]:
pd.concat([s1,s2,s3],axis=1,keys=['one','two','three'])

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

# concating DataFrames

In [54]:
df1 = DataFrame(np.arange(6).reshape(3,2),index=['a','b','c'],columns=['one','two'])
df1

   one  two
a    0    1
b    2    3
c    4    5

In [55]:
df2 = DataFrame(5  +np.arange(4).reshape(2,2),index=['a','c'],columns=['three','four'])
df2

   three  four
a      5     6
c      7     8

In [58]:
pd.concat([df1,df2],axis=1,keys=['level1','level2'])

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [60]:
#you can store dataframe in dictionary
d={'level1':df1,'level2':df2}
d['level1']

   one  two
a    0    1
b    2    3
c    4    5

In [61]:
pd.concat(d,axis=1)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [62]:
pd.concat([df1,df2],axis=1,keys=['level1','level2'],names=['upper','lower'])

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [63]:
df1=DataFrame(np.random.randn(3,4),columns=['a','b','c','d'])
df2=DataFrame(np.random.randn(2,3),columns=['b','d','a'])

In [64]:
df1

          a         b         c         d
0 -1.922144  1.313348 -0.002504 -0.523978
1  0.623695 -0.497905  0.165470  1.071355
2 -0.304524 -0.193526 -1.485111  1.418828

In [65]:
df2

          b         d         a
0  1.199426  0.982312  0.061516
1  0.028840  0.666193 -0.273244

In [70]:
pd.concat([df1,df2],axis=0)

          a         b         c         d
0 -1.922144  1.313348 -0.002504 -0.523978
1  0.623695 -0.497905  0.165470  1.071355
2 -0.304524 -0.193526 -1.485111  1.418828
0  0.061516  1.199426       NaN  0.982312
1 -0.273244  0.028840       NaN  0.666193

In [71]:
pd.concat([df1,df2],axis=0,ignore_index=True)

          a         b         c         d
0 -1.922144  1.313348 -0.002504 -0.523978
1  0.623695 -0.497905  0.165470  1.071355
2 -0.304524 -0.193526 -1.485111  1.418828
3  0.061516  1.199426       NaN  0.982312
4 -0.273244  0.028840       NaN  0.666193

# Combining data with overlap

In [72]:
#combine_first is same as np.where

In [73]:
a = Series([np.nan,2.5,np.nan,3.5,4.5,np.nan],index=['f','e','d','c','b','a'])
b = Series(np.arange(len(a),dtype=np.float64),index=['f','e','d','c','b','a'])

In [74]:
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [76]:
b[-1]=np.nan
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    NaN
dtype: float64

In [78]:
Series(np.where(pd.isnull(a),b,a))

0    0.0
1    2.5
2    2.0
3    3.5
4    4.5
5    NaN
dtype: float64

In [79]:
b.combine_first(a)

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    NaN
dtype: float64

In [80]:
b[:-2]

f    0.0
e    1.0
d    2.0
c    3.0
dtype: float64

In [81]:
a[2:]

d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [85]:
b[:-2].combine_first(a[2:])#first the elements of b will be taken if not in b then a will be taken

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

In [83]:
#for dataframe

In [86]:
df1 = DataFrame({'a':[1.,np.nan,5.,np.nan],'b':[np.nan,2.,np.nan,6.],'c':range(2,18,4)})
df2 = DataFrame({'a':[5.,4.,np.nan,3.,7.],'b':[np.nan,3.,4.,6.,8.]})

In [87]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [88]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [91]:
df1.combine_first(df2)#if it is available in df1 then it will be taken from df1 else df2

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

# Reshaping and Pivoting

In [1]:
#Rearranging data is known as reshape or pivot operations

# Reshaping with heirarichal index

In [1]:
#stack - > this ''rotates' or pivots from the columns in the data to the rows
#unstack -> this pivots from the rows into the columns

In [5]:
data = DataFrame(np.arange(6).reshape(2,3),index=pd.Index(['ohio','colorado'],name='state'),columns=pd.Index(['one','two','three'],name='number'))
data

number    one  two  three
state
ohio        0    1      2
colorado    3    4      5

In [8]:
result=data.stack()#stack coverts the columns into rows
result

state     number
ohio      one       0
          two       1
          three     2
colorado  one       3
          two       4
          three     5
dtype: int32

In [9]:
result.unstack()#converting heirarichal indexed series back to dataframe

number    one  two  three
state
ohio        0    1      2
colorado    3    4      5

In [12]:
result.unstack(0)#we can use diiferent levels in the heirarichal index,default is 1

state   ohio  colorado
number
one        0         3
two        1         4
three      2         5

In [13]:
result.unstack('state')

state   ohio  colorado
number
one        0         3
two        1         4
three      2         5

In [14]:
#Unstacking might introduce missing data if all of the values in the level arent found in each of the subgroups

In [15]:
s1=Series([0,1,2,3],index=['a','b','c','d'])
s2=Series([4,5,6],index=['c','d','e'])

In [16]:
s1

a    0
b    1
c    2
d    3
dtype: int64

In [17]:
s2

c    4
d    5
e    6
dtype: int64

In [22]:
data2=pd.concat([s1,s2],keys=['one','two'])
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [23]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [24]:
data2.unstack(0)

   one  two
a  0.0  NaN
b  1.0  NaN
c  2.0  4.0
d  3.0  5.0
e  NaN  6.0

In [25]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [26]:
data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [28]:
result

state     number
ohio      one       0
          two       1
          three     2
colorado  one       3
          two       4
          three     5
dtype: int32

In [27]:
df = DataFrame({'left':result,'right':result + 5},columns=pd.Index(['left','right'],name='side'))
df

side             left  right
state    number
ohio     one        0      5
         two        1      6
         three      2      7
colorado one        3      8
         two        4      9
         three      5     10

In [30]:
df.unstack('state')

side   left          right
state  ohio colorado  ohio colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [31]:
df.unstack('state').stack('side')

state         ohio  colorado
number side
one    left      0         3
       right     5         8
two    left      1         4
       right     6         9
three  left      2         5
       right     7        10

# Data Transformation

In [2]:
#Filtering,cleaning and other transformations

# Removing Duplicates

In [7]:
data = DataFrame({'k1':['one']*3 + ['two']*4,'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [8]:
data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [9]:
data.drop_duplicates()#returns a dataframe where duplicated array is TRUE

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [10]:
data['v1']=range(7)
data

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [11]:
data.drop_duplicates(['k1'])#duplicates and drop_duplicates by default keep the first observed value combination.

    k1  k2  v1
0  one   1   0
3  two   3   3

In [13]:
#passing take_last=True will return the last one:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
1  one   1   1
2  one   2   2
4  two   3   4
6  two   4   6

# Transforming Data Using a Function or Mapping

In [16]:
data=DataFrame({'food':['bacon','pulled pork','bacon','pastrami','corned beef','bacon','pastrami','honey ham','nova lox'],'ounces':[4,3,12,6,7.5,8,3,5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [17]:
meat_to_animal={'bacon':'pig','pulled pork':'pig','pastrami':'cow','corned beef':'cow','honey ham':'pig','nova lox':'salmon'}
meat_to_animal

{'bacon': 'pig',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon',
 'pastrami': 'cow',
 'pulled pork': 'pig'}

In [18]:
#the map method on a series accepts a function or dict-like object containing a mapping
data['animal']=data['food'].map(str.lower).map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [20]:
data['food'].map(lambda x:meat_to_animal[x.lower()])#using map and lambda

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

# Replacing values

In [2]:
data = Series([1.,-999.,2.,-999.,-1000.,3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [3]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [4]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [5]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

# Renaming Axis Indices

In [3]:
data = DataFrame(np.arange(12).reshape((3,4)),index=['ohio','colorado','ney york'],columns=['one','two','three','four'])
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
ney york    8    9     10    11

In [8]:
data.index.map(str.upper)

array(['OHIO', 'COLORADO', 'NEY YORK'], dtype=object)

In [9]:
data.index = data.index.map(str.upper)
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEY YORK    8    9     10    11

In [12]:
#transforming the dataset without modifying the original

In [10]:
data.rename(index=str.title,columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
Ney York    8    9     10    11

In [11]:
data.rename(index={'OHIO':'INDIANA','NEY YORK':'NEW YORK'},columns={'three':'peekaboo'})

          one  two  peekaboo  four
INDIANA     0    1         2     3
COLORADO    4    5         6     7
NEW YORK    8    9        10    11

In [12]:
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEY YORK    8    9     10    11

In [ ]:
#to modify a dataset,pass inplace = True

In [13]:
data.rename(index={'OHIO':'INDIANA','NEY YORK':'NEW YORK'},columns={'three':'peekaboo'},inplace=True)

In [14]:
data

          one  two  peekaboo  four
INDIANA     0    1         2     3
COLORADO    4    5         6     7
NEW YORK    8    9        10    11

# Discretization and Binning

In [ ]:
#to subdivide a data set into categories of certain range

In [15]:
ages=[20,22,25,27,21,23,37,31,61,45,41,32]
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [16]:
bins=[18,25,35,60,100]
bins

[18, 25, 35, 60, 100]

In [17]:
cats=pd.cut(ages,bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, object): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [19]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [22]:
cats.categories

Index(['(18, 25]', '(25, 35]', '(35, 60]', '(60, 100]'], dtype='object')

In [23]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [24]:
#which side needs to be closed can be changed by passing right = False

In [25]:
pd.cut(ages,[18,26,36,61,100],right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, object): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [26]:
#pass your own bin names

In [27]:
group_names = ['Youth','youngAdult','MiddleAged','Senior']
pd.cut(ages,bins,labels=group_names)

[Youth, Youth, Youth, youngAdult, Youth, ..., youngAdult, Senior, MiddleAged, MiddleAged, youngAdult]
Length: 12
Categories (4, object): [Youth < youngAdult < MiddleAged < Senior]

In [28]:
#A closely related function,qcut,bins the data based on sample quantiles.
data = np.random.randn(1000) #Normally distributed
cats=pd.qcut(data,4) #cut into quartiles

In [29]:
cats

[(-0.643, 0.0132], (0.654, 2.997], (0.0132, 0.654], (0.0132, 0.654], (0.0132, 0.654], ..., (0.0132, 0.654], (0.654, 2.997], (0.654, 2.997], (-0.643, 0.0132], [-2.995, -0.643]]
Length: 1000
Categories (4, object): [[-2.995, -0.643] < (-0.643, 0.0132] < (0.0132, 0.654] < (0.654, 2.997]]

In [30]:
pd.value_counts(cats)

(0.654, 2.997]      250
(0.0132, 0.654]     250
(-0.643, 0.0132]    250
[-2.995, -0.643]    250
dtype: int64

In [32]:
pd.qcut(data,[0,0.1,0.5,0.9,1.])#pass your own quantiles

[(-1.293, 0.0132], (0.0132, 1.304], (0.0132, 1.304], (0.0132, 1.304], (0.0132, 1.304], ..., (0.0132, 1.304], (1.304, 2.997], (0.0132, 1.304], (-1.293, 0.0132], [-2.995, -1.293]]
Length: 1000
Categories (4, object): [[-2.995, -1.293] < (-1.293, 0.0132] < (0.0132, 1.304] < (1.304, 2.997]]

# Detecting and Filtering Outliers

In [33]:
np.random.seed(12345)
data = DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067684     0.067924     0.025598    -0.002298
std       0.998035     0.992106     1.006835     0.996794
min      -3.428254    -3.548824    -3.184377    -3.745356
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.366626     2.653656     3.260383     3.927528

In [34]:
#to find values in one of the columns
col = data[3]
col[np.abs(col) > 3]

97     3.927528
305   -3.399312
400   -3.745356
Name: 3, dtype: float64

In [35]:
#to select all rows having a value exceeding 3 or -3 we can use any

In [41]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
5   -0.539741  0.476985  3.248944 -1.021228
97  -0.774363  0.552936  0.106061  3.927528
102 -0.655054 -0.565230  3.176873  0.959533
305 -2.315555  0.457246 -0.025907 -3.399312
324  0.050188  1.951312  3.260383  0.963301
400  0.146326  0.508391 -0.196713 -3.745356
499 -0.293333 -0.242459 -3.056990  1.918403
523 -3.428254 -0.296336 -0.439938 -0.867165
586  0.275144  1.179227 -3.184377  1.369891
808 -0.362528 -3.548824  1.553205 -2.186301
900  3.366626 -2.372214  0.851010  1.332846

In [61]:
np.sign(data)

       0    1    2    3
0   -1.0  1.0 -1.0 -1.0
1    1.0  1.0  1.0  1.0
2    1.0  1.0  1.0 -1.0
3    1.0  1.0  1.0  1.0
4   -1.0 -1.0  1.0 -1.0
5   -1.0  1.0  1.0 -1.0
6   -1.0  1.0  1.0  1.0
7    1.0  1.0 -1.0 -1.0
8   -1.0 -1.0 -1.0  1.0
9   -1.0  1.0 -1.0  1.0
10  -1.0 -1.0 -1.0 -1.0
11  -1.0  1.0  1.0 -1.0
12   1.0  1.0  1.0  1.0
13  -1.0  1.0  1.0 -1.0
14  -1.0  1.0  1.0 -1.0
15   1.0 -1.0  1.0  1.0
16   1.0 -1.0 -1.0 -1.0
17  -1.0 -1.0 -1.0  1.0
18   1.0  1.0  1.0 -1.0
19  -1.0 -1.0 -1.0  1.0
20   1.0 -1.0  1.0  1.0
21   1.0  1.0 -1.0  1.0
22  -1.0  1.0  1.0  1.0
23  -1.0  1.0  1.0  1.0
24   1.0 -1.0  1.0  1.0
25  -1.0 -1.0 -1.0 -1.0
26  -1.0 -1.0  1.0  1.0
27  -1.0  1.0 -1.0  1.0
28   1.0 -1.0 -1.0 -1.0
29   1.0 -1.0  1.0 -1.0
..   ...  ...  ...  ...
970  1.0  1.0  1.0 -1.0
971 -1.0 -1.0 -1.0  1.0
972  1.0  1.0 -1.0 -1.0
973 -1.0  1.0  1.0 -1.0
974 -1.0 -1.0  1.0 -1.0
975 -1.0 -1.0  1.0 -1.0
976  1.0  1.0  1.0  1.0
977 -1.0  1.0  1.0  1.0
978  1.0 -1.0  1.0  1.0
979  1.0  1.0 -1.0  1.0
980 -1.0 -1.0 -1.0 -1.0
981 -1.0  1.0  1.0  1.0
982 -1.0  1.0  1.0  1.0
983 -1.0  1.0  1.0  1.0
984  1.0 -1.0  1.0 -1.0
985 -1.0  1.0  1.0  1.0
986 -1.0 -1.0  1.0 -1.0
987 -1.0 -1.0  1.0 -1.0
988 -1.0  1.0 -1.0 -1.0
989  1.0  1.0  1.0  1.0
990 -1.0 -1.0 -1.0  1.0
991  1.0 -1.0  1.0  1.0
992 -1.0  1.0 -1.0 -1.0
993  1.0  1.0 -1.0  1.0
994  1.0 -1.0  1.0  1.0
995  1.0  1.0 -1.0  1.0
996 -1.0 -1.0 -1.0 -1.0
997 -1.0  1.0  1.0  1.0
998 -1.0 -1.0 -1.0 -1.0
999  1.0  1.0  1.0  1.0

[1000 rows x 4 columns]

In [63]:
data[np.abs(data)>3] = np.sign(data)*3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067623     0.068473     0.025153    -0.002081
std       0.995485     0.990253     1.003977     0.989736
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.000000     2.653656     3.000000     3.000000

# Permutation and Random Sampling

In [64]:
#Permuting(randomly reordering) a Series or the rows in a DataFrame is easy to do using the numpy.random.permutation 
#function

In [65]:
df = DataFrame(np.arange(20).reshape(5,4))
sampler = np.random.permutation(5)
sampler

array([1, 0, 2, 3, 4])

In [71]:
df.ix[sampler]

    0   1   2   3
1   4   5   6   7
0   0   1   2   3
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [72]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
0   0   1   2   3
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [73]:
#to select a random subset without replacement

In [74]:
df.take(np.random.permutation(len(df))[:3])

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
4  16  17  18  19

In [75]:
#to generate a sample with replacement

In [76]:
bag = np.array([5,7,-1,6,4])
sampler = np.random.randint(0,len(bag),size = 10)

In [77]:
sampler

array([4, 4, 2, 2, 2, 0, 3, 0, 4, 1])

In [78]:
draws = bag.take(sampler)
draws

array([ 4,  4, -1, -1, -1,  5,  6,  5,  4,  7])

# Computing Indicator/Dummy variables

In [ ]:
#If a column in a dataframe has k distinct values,you would derive a matrix or DataFrame containing K columns
#containing all 1's and 0's

In [79]:
df = DataFrame({'Key':['b','b','a','c','a','b'],'data1':range(6)})
df

  Key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [85]:
pd.get_dummies(df['Key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [86]:
pd.get_dummies(df['data1'])

   0  1  2  3  4  5
0  1  0  0  0  0  0
1  0  1  0  0  0  0
2  0  0  1  0  0  0
3  0  0  0  1  0  0
4  0  0  0  0  1  0
5  0  0  0  0  0  1

In [89]:
dummies = pd.get_dummies(df['Key'],prefix = 'key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [96]:
df[['data1']]

   data1
0      0
1      1
2      2
3      3
4      4
5      5

In [97]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [98]:
pd.concat([df[['data1']],dummies],axis=1)

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

# String Manipulation

# String object methods

In [1]:
val = 'a,b, guido'
val.split(',')

['a', 'b', ' guido']

In [4]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [6]:
first,second,third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [7]:
'::'.join(pieces)

'a::b::guido'

In [9]:
val

'a,b, guido'

In [12]:
val.index('g')

5

In [13]:
val.find(':')

-1

In [15]:
val.index[':']

TypeError: 'builtin_function_or_method' object is not subscriptable

In [16]:
val.count(',')

2

In [17]:
val.replace(',','::')

'a::b:: guido'

In [18]:
val.replace(',','')

'ab guido'

In [20]:
''.join(pieces)

'abguido'

# Regular expressions

In [23]:
#The re module functions fall into three categories:pattern matching,substitution and splitting.

In [24]:
#Suppose we want to split a string with a variable number of whitespace characters(tabs,spaces,and newlines).The regex
#describing one or more white space characters is '\s+'

In [25]:
import re
text = 'foo   bar\t baz \tqux'
re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

In [27]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [28]:
regex.findall(text)

['   ', '\t ', ' \t']

In [29]:
#match and search are closely related to findall.While findall returns all matches in a string,search returns only the 
#first match.Match only matches at the beginning of the string

In [30]:
text="""Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
#re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern,flags = re.IGNORECASE)

In [31]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [32]:
regex.split(text)

['Dave ', '\nSteve ', '\nRob ', '\nRyan ', '\n']

In [33]:
#Search returns a special match object for the first email address in the text.For the above regex,the match object
#can only tell us the start and end position of the pattern in the string:

In [34]:
m = regex.search(text)
m

In [35]:
m.start()

5

In [36]:
m.end()

20

In [37]:
text[m.start():m.end()]

'dave@google.com'

In [38]:
#regex.match returns None, as it only will match if the pattern occurs at the start of the string:
print (regex.match(text))

None

In [40]:
#sub will return a new string with occurances of the pattern replaced by a new string:
print (regex.sub('REDACTED',text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [43]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern,flags=re.IGNORECASE)
m = regex.match('rony@gmail.com')

In [44]:
m.groups()

('rony', 'gmail', 'com')

In [45]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [47]:
#sub also has access to groups in each match using special symbols like \,\, etc::
print (regex.sub(r'Username: \1,Domain: \2, Suffix: \3',text))

Dave Username: dave,Domain: google, Suffix: com
Steve Username: steve,Domain: gmail, Suffix: com
Rob Username: rob,Domain: gmail, Suffix: com
Ryan Username: ryan,Domain: yahoo, Suffix: com

In [48]:
#Vectorized string functions in pandas

In [49]:
data = {'Dave':'dave@google.com','Steve':'steve@gmail.com','Rob':'rob@gmail.com','Wes':np.nan}
data = Series(data)

In [50]:
data

Dave     dave@google.com
Rob        rob@gmail.com
Steve    steve@gmail.com
Wes                  NaN
dtype: object

In [51]:
#string and regular expression methods can be applied to each value using data.map,but it will fail on the NA

In [52]:
data.str.contains('gmail')

Dave     False
Rob       True
Steve     True
Wes        NaN
dtype: object

In [53]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [54]:
data.str.findall(pattern,flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Rob        [(rob, gmail, com)]
Steve    [(steve, gmail, com)]
Wes                        NaN
dtype: object

In [56]:
matches = data.str.match(pattern,flags = re.IGNORECASE)
matches

C:\Users\HP\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: In future versions of pandas, match will change to always return a bool indexer.
  if __name__ == '__main__':

Dave     (dave, google, com)
Rob        (rob, gmail, com)
Steve    (steve, gmail, com)
Wes                      NaN
dtype: object

In [57]:
matches.str.get(1)

Dave     google
Rob       gmail
Steve     gmail
Wes         NaN
dtype: object

In [58]:
matches.str[0]

Dave      dave
Rob        rob
Steve    steve
Wes        NaN
dtype: object

In [59]:
data.str[:5]

Dave     dave@
Rob      rob@g
Steve    steve
Wes        NaN
dtype: object